# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name SlowRC -T {125} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1} -postRoute_cap {1} -postRoute_xcap {1} -postRoute_clkres {0} -postRoute_clkcap {0} -cap_table {/tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Back_End/lef/tcbn65lplvt_200a/techfiles/captable/cln65lp_1p09m+alrdl_top2_cworst.captable}
create_rc_corner -name FastRC -T {-40} -preRoute_res {1} -preRoute_cap {1} -preRoute_clkres {0} -preRoute_clkcap {0} -postRoute_res {1} -postRoute_cap {1} -postRoute_xcap {1} -postRoute_clkres {0} -postRoute_clkcap {0} -cap_table {/tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Back_End/lef/tcbn65lplvt_200a/techfiles/captable/cln65lp_1p09m+alrdl_top2_cbest.captable}
create_library_set -name Typ -timing { /tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tcbn65lplvt_220a/tcbn65lplvttc.lib /tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tpdn65lpnv2od3_200a/tpdn65lpnv2od3tc.lib}
create_library_set -name Min -timing {/tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tcbn65lplvt_220a/tcbn65lplvtbc.lib /tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tpdn65lpnv2od3_200a/tpdn65lpnv2od3bc.lib}
create_library_set -name Max -timing {/tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tcbn65lplvt_220a/tcbn65lplvtwc.lib /tools/kits/TSMCPDK/TSMC65/TSMCHOME/digital/Front_End/timing_power_noise/NLDM/tpdn65lpnv2od3_200a/tpdn65lpnv2od3wc.lib}
create_constraint_mode -name TypCM -sdc_files {../datain/top.sdc} 
create_delay_corner -name SlowDC -library_set {Max}  -rc_corner {SlowRC}
create_delay_corner -name FastDC -library_set {Min}  -rc_corner {FastRC}
create_analysis_view -name FastView -constraint_mode {TypCM} -delay_corner {FastDC}
create_analysis_view -name SlowView -constraint_mode {TypCM} -delay_corner {SlowDC}
set_analysis_view -setup {SlowView} -hold {FastView}

